package hashtable;

/**
 * Integer to Roman
 * -
 * 조건
 *  - 로마 숫자는 소수점 자리값을 가장 높은 자리값에서 가장 낮은 자리값으로 변환한 것을 더해 형성된다.
 *  - 소수 자리값을 로마 숫자로 변환하는 것은 다음과 같은 규칙이 있다
 *  - 값이 4 또는 9로 시작하지 않는 경우 입력에서 뺄 수 있는 최대값의 기호를 선택하고 해당 기호를 결과에 추가한 다음 해당 값을 뺀 다음 나머지를 로마 숫자로 변환합니다.
 *  - 값이 4 또는 9로 시작하는 경우, 예를 들어 4는 5(V)보다 1(I) 작습니다. IV 및 9는 10(X)보다 1(I) 작습니다. IX: 4(IV), 9(IX), 40(XL), 90(XC), 400(CD) 및 900(CM)과 같은 감산 형식만 사용됩니다.
 *  - 10의 배수를 나타내기 위해 10의 거듭제곱(I, X, C, M)만 최대 3회 연속적으로 더할 수 있습니다. 5(V), 50(L), 500(D)은 여러 번 더할 수 없습니다. 기호를 4번 추가해야 하는 경우 뺄셈 형식을 사용하십시오.
 * */

public class IntegerToRoman {

    public static void main(String[] args) {

    }

    /**
     * 시도
     * -
     * 풀이
     * -
     * */
}
